app/controllers/todo_items_controller.rb

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-10-05 11:50:16.071356"], ["updated_at", "2015-10-05 11:50:16.072125"], ["id", 2]]
---
	def complete
		@todo_item.toggle_completion